OrgFiles/Emacs.org
#+title Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ../init.el :mkdirp yes

* Introduction
Welcome to my personal Emacs configuration, neatly organized within this Org document. The primary goal here is to create a setup that's not only efficient and tailored to my workflow but also well-documented for future reference. By leveraging `org-mode`, I aim to keep this configuration readable and easily modifiable.

** Key Highlights:
- **Bootstrap and Package Management:** Setting up `straight.el` and `use-package` for a cleaner package management experience.
- **Basic and UI Settings:** Customizing Emacs to look and behave just the way I like, focusing on aesthetics and usability.
- **Org Mode Enhancements:** Fine-tuning `org-mode` for productivity in note-taking, task management, and literate programming.
- **Development Tools:** Configuring essential tools for coding, including autocompletion, syntax checking, and more.

This document is primarily for my future self, to navigate and understand the choices made at different points in time. It's structured to facilitate easy updates and adjustments as my Emacs journey evolves.

* Bootstrap and Package Management
** Bootstrap straight.el
*** Straight.el Setup
`straight.el` is an Emacs package manager that offers an alternative to the built-in `package.el`. It focuses on reproducibility, extensibility, and performance. Unlike `package.el`, `straight.el` clones packages directly from their source repositories, allowing for easy modification, contribution back to upstream, and ensuring that you're always working with the latest version of a package.

One of the key reasons for choosing `straight.el` is its seamless integration with `use-package`, which simplifies the declaration and management of package configurations. Additionally, `straight.el`'s approach to package management aligns well with my preference for having a more controlled and transparent setup.


for more information see: [[https://github.com/radian-software/straight.el][github repositry for straight]]!

#+begin_src emacs-lisp
  ;; -*- lexical-binding: t -*-

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

This snippet ensures that `straight.el` is properly bootstrapped in my Emacs setup. It checks if the bootstrap file is already present; if not, it downloads and evaluates it. This is crucial for initializing `straight.el` and making it ready to manage other packages.

** Use-Package Integration
`use-package` simplifies Emacs package configuration, and its integration with `straight.el` enhances package installation directly from source repositories. Below is the essential configuration to integrate `use-package` with `straight.el`:

#+BEGIN_SRC emacs-lisp
  ;; Integrate use-package with straight.el for package installation

  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
#+END_SRC

This configuration ensures all packages declared with `use-package` are automatically managed by `straight.el`, simplifying package installation and management in my Emacs setup.
If that should not be the case, you can use ':straight nil' to disable straight for a specific package. 

* Basic Settings 
** Configuration Variables
To enhance modularity and ease of customization, key aspects of the Emacs setup are controlled through variables. These variables allow for quick adjustments without delving into the configuration details. Here are some foundational variables defined for this purpose:

#+BEGIN_SRC emacs-lisp
  (defvar exile/default-font-size 150 "Default font size for Emacs.")
  (defvar exile/font-name "CaskaydiaCove Nerd Font" "Default font for Emacs.")
  (defvar exile/theme 'doom-gruvbox "Default theme for Emacs.")
  (defvar exile/org-directory "~/.emacs.d/OrgFiles/" "Directory for Org files.")
  (defvar exile/emacs-file (concat exile/org-directory "Emacs.org") "Our Emacs Configuration")
  (defvar exile/org-agenda-files '("~/.emacs.d/OrgFiles/Tasks.org"
  	"~/.emacs.d/OrgFiles/Birthdays.org"
  	"~/.emacs.d/OrgFiles/Habits.org"
  	"~/.emacs.d/OrgFiles/DrawingTasks.org"
  	))
  (defvar exile/padding 10 "Padding for text area.")

  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(warning-suppress-log-types '(((copilot copilot-no-mode-indent)))))
  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   )

#+END_SRC

These variables are used throughout the configuration to maintain consistency and facilitate easy updates or modifications.

** Setting Default Encoding
UTF-8 is a widely adopted encoding standard that can represent virtually any character from all modern writing systems. Here, I set UTF-8 as the default encoding for all Emacs operations to ensure consistent handling of file contents.

#+BEGIN_SRC emacs-lisp

  ;; Set UTF-8 as the default encoding
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8)
#+END_SRC

This setup guarantees that Emacs will favor UTF-8 for all encoding and decoding tasks, from reading and writing files to interacting with external processes, enhancing overall compatibility and reliability.

** Basic UI Settings
These Emacs customizations streamline the interface for a cleaner look and feel.

#+BEGIN_SRC emacs-lisp

  ;; Hide the startup message
  (setq inhibit-startup-message t)

  ;; Disable the scroll bar, tool bar, and tooltips
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)

  ;; Add padding around the text area
  (set-fringe-mode exile/padding)

  ;; Use a visual bell instead of an audible one
  (setq visible-bell t)

  ;; Disable the menu bar
  (menu-bar-mode -1)

  ;; Set frame transparency
  (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))

  ;; Line numbers
  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Exclude line numbers in certain modes
  (dolist (mode '(org-mode-hook
                 term-mode-hook
                 shell-mode-hook
                 eshell-mode-hook))
   (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+END_SRC

These settings adjust visual elements like bars and menus, and apply transparency to the frame for a minimalist workspace and add line numbers to the left of each line in the buffer.
* Font Configuration
** Setting Custom Fonts
To ensure a consistent and comfortable reading experience across Emacs, custom fonts are set for general use, code editing, and `org-mode` enhancements. The chosen font, is applied to key faces, with specific adjustments for improved legibility and aesthetics.

#+BEGIN_SRC emacs-lisp

  ;; Set the default, fixed-pitch, and variable-pitch fonts
  (set-face-attribute 'default nil :font exile/font-name :height exile/default-font-size)
  (set-face-attribute 'fixed-pitch nil :font exile/font-name :height exile/default-font-size)
  (set-face-attribute 'variable-pitch nil :font exile/font-name :height exile/default-font-size :weight 'regular)
#+END_SRC

In addition to these general settings, font-specific adjustments within `org-mode` are crucial for a unified and visually appealing documentation and note-taking environment.

*** Org Mode Font Customization
`org-mode` benefits from tailored font settings for headings, blocks, and special keywords to distinguish structure and content visually.

#+BEGIN_SRC emacs-lisp
(defun exile/org-font-setup ()
;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
			  '(("^ *\\([-]\\) "
			    (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  (dolist (face '((org-level-1 . 1.6)
                  (org-level-2 . 1.5)
                  (org-level-3 . 1.4)
                  (org-level-4 . 1.4)
                  (org-level-5 . 1.3)
                  (org-level-6 . 1.3)
                  (org-level-7 . 1.2)
                  (org-level-8 . 1.2)))
    (set-face-attribute (car face) nil
			:font exile/font-name 
			:weight 'regular
			:height (round (* 100 (cdr face)))))

;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground 'unspecified :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
 )
#+END_SRC

Integrating font settings for `org-mode` within this section aligns with the goal of maintaining visual consistency and enhances the readability and aesthetic appeal of `org-mode` documents.
* Key Bindings and Utilities
