init.el
;; -*- lexical-binding: t -*-

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Integrate use-package with straight.el for package installation

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(defvar exile/default-font-size 150 "Default font size for Emacs.")
(defvar exile/font-name "CaskaydiaCove Nerd Font" "Default font for Emacs.")
(defvar exile/theme 'doom-gruvbox "Default theme for Emacs.")
(defvar exile/org-directory "~/.emacs.d/OrgFiles/" "Directory for Org files.")
(defvar exile/emacs-file (concat exile/org-directory "Emacs.org") "Our Emacs Configuration")
(defvar exile/org-agenda-files '("~/.emacs.d/OrgFiles/Tasks.org"
	"~/.emacs.d/OrgFiles/Birthdays.org"
	"~/.emacs.d/OrgFiles/Habits.org"
	"~/.emacs.d/OrgFiles/DrawingTasks.org"
	))
(defvar exile/padding 10 "Padding for text area.")

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(warning-suppress-log-types '(((copilot copilot-no-mode-indent)))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )

;; Set UTF-8 as the default encoding
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)

;; Hide the startup message
(setq inhibit-startup-message t)

;; Disable the scroll bar, tool bar, and tooltips
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)

;; Add padding around the text area
(set-fringe-mode exile/padding)

;; Use a visual bell instead of an audible one
(setq visible-bell t)

;; Disable the menu bar
(menu-bar-mode -1)

;; Set frame transparency
(set-frame-parameter (selected-frame) 'alpha '(90 . 90))
(add-to-list 'default-frame-alist '(alpha . (90 . 90)))

;; Line numbers
(column-number-mode)
(global-display-line-numbers-mode t)

;; Exclude line numbers in certain modes
(dolist (mode '(org-mode-hook
               term-mode-hook
               shell-mode-hook
               eshell-mode-hook))
 (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; Set the default, fixed-pitch, and variable-pitch fonts
(set-face-attribute 'default nil :font exile/font-name :height exile/default-font-size)
(set-face-attribute 'fixed-pitch nil :font exile/font-name :height exile/default-font-size)
(set-face-attribute 'variable-pitch nil :font exile/font-name :height exile/default-font-size :weight 'regular)

(defun exile/org-font-setup ()
;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
			  '(("^ *\\([-]\\) "
			    (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  (dolist (face '((org-level-1 . 1.6)
                  (org-level-2 . 1.5)
                  (org-level-3 . 1.4)
                  (org-level-4 . 1.4)
                  (org-level-5 . 1.3)
                  (org-level-6 . 1.3)
                  (org-level-7 . 1.2)
                  (org-level-8 . 1.2)))
    (set-face-attribute (car face) nil
			:font exile/font-name 
			:weight 'regular
			:height (round (* 100 (cdr face)))))

;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground 'unspecified :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
 )
