OrgFiles/Emacs.org
** General Keybindings
`general.el` is used to create more intuitive and memorable keybindings, improving workflow and productivity. Below is the configuration that sets up global and mode-specific keybindings using `general.el`.

#+BEGIN_SRC emacs-lisp

  ;; Org mode configuration for habit tracking
  (defun exile/org-set-habit ()
    "Set the current Org mode item as a habit."
    (interactive)
    (org-set-property "STYLE" "habit"))


   ;; General keybindings management
   (use-package general
     :config
     (general-create-definer exile/leader-keys
       :keymaps '(normal insert visual emacs)
       :prefix "SPC" 
       :global-prefix "C-SPC")

     ;; Define Magit keybindings under the 'g' prefix for Git
     (exile/leader-keys
       "g" '(:ignore t :which-key "git (magit)")
       "gs" '(magit-status :which-key "status")
       "gc" '(magit-commit :which-key "commit")
       "gp" '(:ignore t :which-key "push/pull")
       "gpp" '(magit-push :which-key "push")
       "gpl" '(magit-pull :which-key "pull")
       "gb" '(magit-branch :which-key "branch")
       "gf" '(magit-fetch :which-key "fetch")
       "gl" '(magit-log-all :which-key "log")
       "gd" '(magit-diff :which-key "diff"))

     ;; Define keybindings for copilot under the 'c' prefix
     (exile/leader-keys
      "c" '(:ignore t :which-key "copilot")
      "cm" '(exile/copilot-toggle-manual-mode :which-key "toggle manual mode")
      "ce" '(exile/copilot-activate :which-key "enable copilot")
      "cd" '(exile/copilot-deactivate :which-key "disable copilot")
      )

     ;; for org mode keybindings under the 'o' prefix 
     (exile/leader-keys
      "o" '(:ignore t :which-key "org mode")
      "oc" '(org-capture :which-key "capture")
      "oa" '(org-agenda :which-key "agenda")
      "ot" '(counsel-org-tag :which-key "set tags")
      "oe" '(org-set-effort :which-key "set effort based on time")
      "ol" '(org-insert-link :which-key "insert link")
      "oi" '(org-toggle-inline-images :which-key "toggle images")
      "or" '(org-refile :which-key "refile")
      "os" '(org-schedule :which-key "schedule")
      "od" '(org-deadline :which-key "deadline")
      "ou" '(org-time-stamp :which-key " add a time stamp")
      "oh" '(exile/org-set-habit :which-key "set as habit")
      )
     )
#+END_SRC
This configuration organizes keybindings into logical groups, making them more manageable and easier to remember. By utilizing `:which-key` descriptions, we also ensure that prompts are available to guide me.
* Package Configuration
** Counsel and Ivy Configuration
*** Counsel
Counsel is a collection of Ivy-enhanced versions of common Emacs commands. It provides a more modern and user-friendly interface for various built-in Emacs functions, such as `find-file`, `grep`, and `describe-function`. Below is the configuration to set up `counsel` in my Emacs setup.

#+BEGIN_SRC emacs-lisp

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (setq ivy-initial-inputs-alist nil))  ;; Don't start searches with ^
#+END_SRC

This setup binds common actions like `M-x`, buffer switching, and file finding to their `counsel` counterparts, significantly improving the user experience by offering more intelligent and flexible completion options. Additionally, it configures `counsel` to not prepend `^` to searches, making for a more natural typing experience.
*** Ivy
Ivy enhances Emacs by providing a flexible interface for text completion and search functionalities. It's central to streamlining interactions with buffers, files, and commands. Below is the configuration that sets up Ivy along with some essential customizations for an optimal experience.

#+BEGIN_SRC emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper) ;; Swiper replaces default Emacs search with Ivy-powered search.
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done) ;; Allows TAB to select an item from the completion list.
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line) ;; Navigate completion list.
           ("C-k" . ivy-previous-line) ;; Navigate completion list.
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill) ;; Kill buffer from switch buffer list.
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill)) ;; Kill buffer from reverse search list.
    :config
    (ivy-mode 1) ;; Enable Ivy globally at startup.
    (setq ivy-use-virtual-buffers t) ;; Add ‘recentf-mode’ and bookmarks to ‘ivy-switch-buffer’.
    (setq ivy-count-format "(%d/%d) ")) ;; Display the current and total number in the completion list.
#+END_SRC

With Ivy, searching, switching between buffers, and finding files becomes more intuitive and efficient, thanks to its predictive text completion and minimalist interface. This setup ensures that Ivy is seamlessly integrated into the Emacs environment, enhancing the overall user experience without overwhelming the screen with unnecessary information.
*** Ivy Enhancements
**** Ivy Prescient
Ivy Prescient further refines Ivy's completion mechanism by introducing more intelligent sorting and filtering. This makes finding files, buffers, and commands even faster and more intuitive.

#+BEGIN_SRC emacs-lisp

  (use-package ivy-prescient
    :after ivy
    :config
    (ivy-prescient-mode 1) ;; Activate Ivy Prescient.
    (prescient-persist-mode 1)) ;; Remember frequently used commands.
#+END_SRC

This configuration activates Ivy Prescient right after Ivy is loaded, ensuring that all completions benefit from improved sorting and filtering. The `prescient-persist-mode` further enhances this by remembering the most frequently used items, making them appear at the top of the completion list over time.
**** Ivy Rich
Ivy Rich enhances the default Ivy experience by adding more context to the items in the completion list. It makes navigating through buffers, search results, and commands more informative by displaying additional details alongside each entry.

#+BEGIN_SRC emacs-lisp

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1) ; Enable Ivy Rich globally
    :config
    ;; Customize the display transformation for various Ivy commands to include more details
    (setq ivy-rich-display-transformers-list
          (plist-put ivy-rich-display-transformers-list
                     'ivy-switch-buffer
                     '(:columns
                       ((ivy-rich-candidate (:width 30)) ; Buffer name
                        (ivy-rich-switch-buffer-size (:width 7)) ; Buffer size
                        (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right)) ; Modified status
                        (ivy-rich-switch-buffer-major-mode (:width 12 :face warning)) ; Major mode
                        (ivy-rich-switch-buffer-project (:width 15 :face success)) ; Project name or directory
                        (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3)))))) ; File path that is shortened based on width
                       :predicate
                       (lambda (cand) (get-buffer cand)))))); Only display opened buffers 
#+END_SRC

This setup not only activates Ivy Rich but also customizes how information is displayed for the `ivy-switch-buffer` command. The columns can be adjusted to include information more information or to remove some of the information.
**** All-the-Icons-Ivy
All-the-Icons-Ivy enhances the appearance of Ivy completion candidates by adding icons to them. This makes the completion list more visually appealing and easier to navigate.

#+BEGIN_SRC emacs-lisp

  (use-package all-the-icons-ivy
    :after ivy
    :init
    (all-the-icons-ivy-setup)) ;; Automatically enhances Ivy completion with icons
#+END_SRC

** Which-key Configuration
Which Key is a utility that improves the discoverability of keybindings in Emacs. It displays a popup with available commands and their descriptions following a prefix key, making it easier to remember shortcuts. 

#+BEGIN_SRC emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3)
    )
#+END_SRC

** Helpful Configuration
Helpful is an alternative to the built-in Emacs help that provides more context and better navigation. It enhances the help experience by displaying documentation in a more readable format and offering additional features like keybinding lookup.

#+begin_src emacs-lisp

  ;; A more informative help system
  (use-package helpful
    :bind (([remap describe-function] . counsel-describe-function)
           ([remap describe-command] . helpful-command)
           ([remap describe-variable] . counsel-describe-variable)
           ([remap describe-key] . helpful-key))
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    )
#+end_src
** Evil Mode Configuration
*** Basic Evil Mode Setup
Evil Mode provides Vim keybindings and modal editing features.Below is the basic configuration to set it up.

#+begin_src emacs-lisp

  (use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)
  )
#+end_src
