init.el

;; Org mode configuration for habit tracking
(defun exile/org-set-habit ()
  "Set the current Org mode item as a habit."
  (interactive)
  (org-set-property "STYLE" "habit"))


 ;; General keybindings management
 (use-package general
   :config
   (general-create-definer exile/leader-keys
     :keymaps '(normal insert visual emacs)
     :prefix "SPC" 
     :global-prefix "C-SPC")

   ;; Define Magit keybindings under the 'g' prefix for Git
   (exile/leader-keys
     "g" '(:ignore t :which-key "git (magit)")
     "gs" '(magit-status :which-key "status")
     "gc" '(magit-commit :which-key "commit")
     "gp" '(:ignore t :which-key "push/pull")
     "gpp" '(magit-push :which-key "push")
     "gpl" '(magit-pull :which-key "pull")
     "gb" '(magit-branch :which-key "branch")
     "gf" '(magit-fetch :which-key "fetch")
     "gl" '(magit-log-all :which-key "log")
     "gd" '(magit-diff :which-key "diff"))

   ;; Define keybindings for copilot under the 'c' prefix
   (exile/leader-keys
    "c" '(:ignore t :which-key "copilot")
    "cm" '(exile/copilot-toggle-manual-mode :which-key "toggle manual mode")
    "ce" '(exile/copilot-activate :which-key "enable copilot")
    "cd" '(exile/copilot-deactivate :which-key "disable copilot")
    )

   ;; for org mode keybindings under the 'o' prefix 
   (exile/leader-keys
    "o" '(:ignore t :which-key "org mode")
    "oc" '(org-capture :which-key "capture")
    "oa" '(org-agenda :which-key "agenda")
    "ot" '(counsel-org-tag :which-key "set tags")
    "oe" '(org-set-effort :which-key "set effort based on time")
    "ol" '(org-insert-link :which-key "insert link")
    "oi" '(org-toggle-inline-images :which-key "toggle images")
    "or" '(org-refile :which-key "refile")
    "os" '(org-schedule :which-key "schedule")
    "od" '(org-deadline :which-key "deadline")
    "ou" '(org-time-stamp :which-key " add a time stamp")
    "oh" '(exile/org-set-habit :which-key "set as habit")
    )
   )

(use-package counsel
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :config
  (setq ivy-initial-inputs-alist nil))  ;; Don't start searches with ^

(use-package ivy
  :diminish
  :bind (("C-s" . swiper) ;; Swiper replaces default Emacs search with Ivy-powered search.
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done) ;; Allows TAB to select an item from the completion list.
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line) ;; Navigate completion list.
         ("C-k" . ivy-previous-line) ;; Navigate completion list.
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill) ;; Kill buffer from switch buffer list.
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill)) ;; Kill buffer from reverse search list.
  :config
  (ivy-mode 1) ;; Enable Ivy globally at startup.
  (setq ivy-use-virtual-buffers t) ;; Add ‘recentf-mode’ and bookmarks to ‘ivy-switch-buffer’.
  (setq ivy-count-format "(%d/%d) ")) ;; Display the current and total number in the completion list.

(use-package ivy-prescient
  :after ivy
  :config
  (ivy-prescient-mode 1) ;; Activate Ivy Prescient.
  (prescient-persist-mode 1)) ;; Remember frequently used commands.

(use-package ivy-rich
  :init
  (ivy-rich-mode 1) ; Enable Ivy Rich globally
  :config
  ;; Customize the display transformation for various Ivy commands to include more details
  (setq ivy-rich-display-transformers-list
        (plist-put ivy-rich-display-transformers-list
                   'ivy-switch-buffer
                   '(:columns
                     ((ivy-rich-candidate (:width 30)) ; Buffer name
                      (ivy-rich-switch-buffer-size (:width 7)) ; Buffer size
                      (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right)) ; Modified status
                      (ivy-rich-switch-buffer-major-mode (:width 12 :face warning)) ; Major mode
                      (ivy-rich-switch-buffer-project (:width 15 :face success)) ; Project name or directory
                      (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3)))))) ; File path that is shortened based on width
                     :predicate
                     (lambda (cand) (get-buffer cand)))))); Only display opened buffers

(use-package all-the-icons-ivy
  :after ivy
  :init
  (all-the-icons-ivy-setup)) ;; Automatically enhances Ivy completion with icons

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3)
  )

;; A more informative help system
(use-package helpful
  :bind (([remap describe-function] . counsel-describe-function)
         ([remap describe-command] . helpful-command)
         ([remap describe-variable] . counsel-describe-variable)
         ([remap describe-key] . helpful-key))
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  )

(use-package evil
:init
(setq evil-want-integration t)
(setq evil-want-keybinding nil)
(setq evil-want-C-u-scroll t)
(setq evil-want-C-i-jump nil)
:config
(evil-mode 1)
(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
(define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

;; use visual line motions even outside of visual-line-mode buffers
(evil-global-set-key 'motion "j" 'evil-next-visual-line)
(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

(evil-set-initial-state 'messages-buffer-mode 'normal)
(evil-set-initial-state 'dashboard-mode 'normal)
)
