OrgFiles/Emacs.org
*** Evil Collection
Evil Collection extends Evil Mode's support to various Emacs packages, ensuring a more consistent and complete Vim emulation experience.

#+begin_src emacs-lisp

  ;; Evil keybindings collection
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init)
    )
#+end_src
*** Undo Tree Integration
Undo Tree provides a visual representation of the undo history in Emacs, making it easier to navigate and manage changes. Below is the configuration to integrate it with Evil Mode.

#+begin_src emacs-lisp

  ;; undo tree
  (use-package undo-tree
    :init
    (global-undo-tree-mode 1)
    :config
    (setq undo-tree-auto-save-history t) ;; Enable auto-saving of undo history
    (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo-tree-history"))) ;; Specify where to save undo history files
    (evil-set-undo-system 'undo-tree))

  ;; Create the directory if it does not exist
  (unless (file-exists-p "~/.emacs.d/undo-tree-history")
    (make-directory "~/.emacs.d/undo-tree-history" t))
#+end_src
** Hydra
Hydra is a package that simplifies the creation of Emacs keybindings with a consistent and intuitive interface. It's particularly useful for defining complex or multi-step commands. 

#+begin_src emacs-lisp

  (use-package hydra
    :config
    (defhydra exile/hydra-text-scale (:timeout 4 :color pink)
      "scale text"
      ("j" text-scale-increase "in")
      ("k" text-scale-decrease "out")
      ("q" nil "quit" :exit t))
  )
#+end_src
** All The Icons
All The Icons is a package that provides a collection of icons for use in Emacs. It enhances the visual appeal of the interface by adding icons to various elements, such as completion candidates and file names.

#+begin_src emacs-lisp

  (use-package all-the-icons
    :if (display-graphic-p) ;; check if Emacs is running in a graphical display and not inside a terminal;
    :commands (all-the-icons-install-fonts)
    :init
    (unless (find-font (font-spec :name "all-the-icons"))
      (all-the-icons-install-fonts t))
    )
#+end_src
** All The Icons Dired
All The Icons Dired is an extension of All The Icons that adds icons to Dired buffers, making file and directory listings more visually appealing and easier to navigate.

#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :if (display-graphic-p) ;; check if Emacs is running in a graphical display and not inside a termina;
    :hook (dired-mode . all-the-icons-dired-mode)
    )
#+end_src
** Doom Modeline
Doom Modeline is a minimal and modern mode-line for Emacs. It provides useful information about the current buffer, project, and Git status, enhancing the overall user experience.
#+begin_src emacs-lisp

  ;; Doom modeline for a fancy status bar
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom (doom-modeline-height 15)
   )

#+end_src
** Doom Themes
Doom Themes is a collection of modern and aesthetically pleasing themes for Emacs. It offers a wide range of options to customize the look and feel of the interface.

#+begin_src emacs-lisp

  ;; doom themes for aesthetics
  (use-package doom-themes
    :init (load-theme 'doom-gruvbox t)
   )
#+end_src
** Magit
Magit is a powerful Git interface for Emacs that provides a comprehensive set of features for managing Git repositories. It simplifies common Git operations and offers a more efficient workflow.
#+begin_src emacs-lisp

  ;; magit - git integration
  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    )

#+end_src

** Rainbow Delimiters
Rainbow Delimiters is a package that highlights nested parentheses, brackets, and braces with different colors, making it easier to visually parse code and understand its structure.

#+begin_src emacs-lisp
  ;; Rainbow delimiters for colorful parentheses
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  )
#+end_src
** Org Mode
*** Org mode setup
This comprehensive setup not only organizes daily tasks and long-term projects but also captures ideas and notes efficiently. The use of `org-habit` for habit tracking, custom `TODO` keywords for workflow management, and capture templates streamline the task management process. Additionally, the agenda views provide a clear overview of upcoming tasks and deadlines, facilitating better time management and planning.

#+begin_src emacs-lisp

  (defun exile/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1)
   )
#+end_src

#+begin_src emacs-lisp
(use-package org
  :hook (org-mode . exile/org-mode-setup)
  :config
  (setq org-ellipsis " ▼")
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-agenda-files exile/org-agenda-files)

  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)
  (setq org-todo-keywords
	'((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
	  (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

  (setq org-refile-targets
    '(("Archive.org" :maxlevel . 1)
      ("Tasks.org" :maxlevel . 1)))

  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (setq org-tag-alist
    '((:startgroup)
       ; Put mutually exclusive tags here
       (:endgroup)
       ("errand" . ?E)
       ("home" . ?H)
       ("work" . ?W)
       ("agenda" . ?a)
       ("planning" . ?p)
       ("note" . ?n)
       ("meeting" . ?m)
       ("personal" . ?P)
       ("idea" . ?i)))

  ;; Configure custom agenda views
  (setq org-agenda-custom-commands
   '(("d" "Dashboard"
     ((agenda "" ((org-deadline-warning-days 7)))
      (todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))
      (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

    ("n" "Next Tasks"
     ((todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))))

    ("W" "Work Tasks" tags-todo "+work")
    ("M" "Meetings" tags-todo "+meeting")

    ;; Low-effort next actions
    ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
     ((org-agenda-overriding-header "Low Effort Tasks")
      (org-agenda-max-todos 20)
      (org-agenda-files org-agenda-files)))

    ("w" "Workflow Status"
     ((todo "WAIT"
            ((org-agenda-overriding-header "Waiting on External")
             (org-agenda-files org-agenda-files)))
      (todo "REVIEW"
            ((org-agenda-overriding-header "In Review")
             (org-agenda-files org-agenda-files)))
      (todo "PLAN"
            ((org-agenda-overriding-header "In Planning")
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo "BACKLOG"
            ((org-agenda-overriding-header "Project Backlog")
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo "READY"
            ((org-agenda-overriding-header "Ready for Work")
             (org-agenda-files org-agenda-files)))
      (todo "ACTIVE"
            ((org-agenda-overriding-header "Active Projects")
             (org-agenda-files org-agenda-files)))
      (todo "COMPLETED"
            ((org-agenda-overriding-header "Completed Projects")
             (org-agenda-files org-agenda-files)))
      (todo "CANC"
            ((org-agenda-overriding-header "Cancelled Projects")
             (org-agenda-files org-agenda-files)))))))

    (setq org-capture-templates
    `(("t" "Tasks / Projects")
      ("tt" "Task" entry (file+olp "~/.emacs.d/OrgFiles/Tasks.org" "Inbox")
           "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

      ("j" "Journal Entries")
      ("jj" "Journal" entry
           (file+olp+datetree "~/.emacs.d/OrgFiles/Journal.org")
           "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
           :clock-in :clock-resume
           :empty-lines 1)
      ("jm" "Meeting" entry
           (file+olp+datetree "~/.emacs.d/OrgFiles/Journal.org")
           "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
           :clock-in :clock-resume
           :empty-lines 1)

      ("w" "Workflows")
      ("we" "Checking Email" entry (file+olp+datetree "~/.emacs.d/OrgFiles/Journal.org")
           "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

      ("m" "Metrics Capture")
      ("mw" "Weight" table-line (file+headline "~/.emacs.d/OrgFiles/Metrics.org" "Weight")
       "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)
      ("me" "Food" table-line (file+headline "~/.emacs.d/OrgFiles/Metrics.org"  "Food")
       "| %U | %^{Food} | %^{Notes} |" :kill-buffer t)))
 
  (exile/org-font-setup) ;; Apply font settings for org-mode see: Font Configuration section
  )
#+end_src
