OrgFiles/Emacs.org
*** org-babel
Org Babel allows for the execution of code blocks within Org documents, supporting multiple programming languages. This functionality is crucial for literate programming, enabling dynamic document generation that combines code execution with narrative text.

To configure Org Babel for various programming languages:

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     ;; Add more languages as needed
     ))
  (setq org-confirm-babel-evaluate nil) ;; Disables confirmation prompt for code block execution.
#+end_src

This configuration loads support for Emacs Lisp and Python, making it possible to execute code blocks written in these languages directly within an Org document. The setting to disable confirmation prompts streamlines the workflow by allowing immediate code execution.

Automatically tangle our emacs.org config file when we save it:

#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun exile/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name exile/emacs-file))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'exile/org-babel-tangle-config)))
#+end_src

** Org Tempo for Easy Template Insertion
Org Tempo provides shortcuts for inserting structured templates, such as source code blocks, making document preparation more efficient.

To extend Org Tempo with shortcuts for various programming languages:

#+begin_src emacs-lisp

  (require 'org-tempo)
  (eval-after-load 'org
  '(progn
    (add-to-list 'org-structure-template-alist '("bat" . "src bat"))))
#+end_src

These additions to `org-structure-template-alist` enable quick insertion of source code blocks for the specified languages by typing `<` followed by the template shortcut (e.g., `<el` for an Emacs Lisp block) and then pressing `TAB`. This feature significantly enhances the efficiency of writing literate programs or documentation that includes code snippets.
*** Org Mode Enhancements
**** org-bullets
A package that replaces the standard bullet points in org-mode with more visually appealing Unicode characters. This enhances the readability and aesthetics of org-mode documents.

#+begin_src emacs-lisp

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "✸" "✿" "✜" "✚" "✦"))
    )
#+end_src

**** Visual-fill-column
A package that enhances the visual appearance of org-mode documents by wrapping the text at a specified column, making it easier to read and navigate long lines.

#+begin_src emacs-lisp

  ;; center text in org mode
  (defun exile/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
  	visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . exile/org-mode-visual-fill)
    )
#+end_src

** Company 
Company Mode is a powerful auto-completion package for Emacs. It provides a wide range of features for code completion, including intelligent suggestions, pop-up documentation, and more.

#+begin_src emacs-lisp

  ;; company - auto-completion
  (use-package company
    :init
    (add-hook 'after-init-hook 'global-company-mode)
    (setq company-minimum-prefix-length 3
          company-selection-wrap-around t 
          company-tooltip-limit 20
          company-tooltip-minimum-width 15
          company-tooltip-align-annotations t))
#+end_src

** Copilot Configuration
Copilot enhances coding in Emacs by providing AI-powered code completion and suggestions. Below are configurations and custom functions tailored for Copilot integration.

#+begin_src emacs-lisp

  (use-package copilot
    :straight (:host github :repo "copilot-emacs/copilot.el" :files ("dist" "*.el"))
    :diminish ;; don't show in mode line (we don't wanna get caught cheating, right? ;)
    :config

    ;; global keybindings
    (general-def
      "TAB" #'exile/company-or-copilot-or-indent ; for tab completion
      "M-C-<return>" #'exile/copilot-trigger ; for manual mode (FIX ME): this doesnt seems to work rn
      )
    )

#+end_src

*** Variables for Copilot
These variables act as flags to control Copilot's behavior and interaction with Company mode.

#+begin_src emacs-lisp
  ;; Flags to control Copilot's behavior
  (defvar exile/copilot-manual-mode nil
    "When `t', Copilot only shows completions when manually triggered.")

  (defvar exile/company-active nil
    "Flag to indicate whether Company's completion menu is active.")
#+end_src

*** Custom Functions for Copilot
These functions provide mechanisms to manage Copilot's overlay and integrate it smoothly with Company mode.
**** Clear Overlay Function
This function ensures that Copilot's suggestions are temporarily hidden to prevent interference with Company mode's completions.

#+begin_src emacs-lisp
  (defun exile/copilot-quit ()
    "Run `copilot-clear-overlay' or `keyboard-quit'. If copilot is cleared, make sure the overlay doesn't come back too soon."
    (interactive)
    (condition-case err
        (when (bound-and-true-p copilot--overlay)
          (let ((pre-copilot-disable-predicates copilot-disable-predicates))
            (setq copilot-disable-predicates (list (lambda () t)))
            (copilot-clear-overlay)
            (run-with-idle-timer
             1.0
             nil
             (lambda ()
               (setq copilot-disable-predicates pre-copilot-disable-predicates)))))
      (error (message "Error handling Copilot overlay: %s" err))))
#+end_src

**** Overlay Management During Company Completion
Activates the overlay clearing function when Company mode starts a completion session.

#+begin_src emacs-lisp
  (defun exile/clear-copilot-during-company ()
    "Clear Copilot's overlay if Company is active."
    (when exile/company-active
      (message "Company completion active, clearing Copilot overlay.")
      (exile/copilot-quit)))
#+end_src

**** Company Mode Hooks
Hooks to detect the start and finish of Company's completion session, adjusting Copilot's behavior accordingly.

#+begin_src emacs-lisp
  (defun exile/company-started (arg)
    "Hook function called when Company completion starts."
    (setq exile/company-active t)
    (add-hook 'pre-command-hook #'exile/clear-copilot-during-company)
    (message "Company completion started."))

  (defun exile/company-finished (arg)
    "Hook function called when Company completion finishes or is cancelled."
    (remove-hook 'pre-command-hook #'exile/clear-copilot-during-company)
    (setq exile/company-active nil))

  ;; Catch the start and finish of company completion
  (with-eval-after-load 'company
    (add-hook 'company-completion-started-hook #'exile/company-started)
    (add-hook 'company-completion-finished-hook #'exile/company-finished)
    (add-hook 'company-completion-cancelled-hook #'exile/company-finished))
#+end_src

**** Copilot Trigger Function
Attempts to initiate Copilot completion, providing a manual trigger option.

#+begin_src emacs-lisp
  (defun exile/copilot-trigger ()
    "Try to trigger completion with Copilot."
    (interactive)
    (if (fboundp 'copilot-complete)
        (copilot-complete)
      (message "Copilot completion function not available.")))
#+end_src

**** Copilot and Company Integration
Manages the interaction between Copilot and Company, ensuring a seamless user experience.

#+begin_src emacs-lisp
  (defun exile/company-or-copilot-or-indent ()
    "Enhanced completion logic to avoid conflicts between Copilot and Company."
    (interactive)
    (cond
     (exile/company-active
      (company-complete-selection))
     ((copilot--overlay-visible)
      (copilot-accept-completion))
     (t
      (indent-for-tab-command))))
#+end_src

**** Copilot Activation and Deactivation
Functions to manually toggle Copilot's activation state and switch between manual and automatic modes.

#+begin_src emacs-lisp
  (defun exile/copilot-activate ()
    "Activate Copilot globally. If already activated, inform the user."
    (interactive)
    (if copilot-mode
        (message "Copilot is already activated")
      (progn
        (copilot-mode 1)
        (setq exile/copilot-manual-mode nil)
        (message "Copilot activated"))))

  (defun exile/copilot-deactivate ()
    "Deactivate Copilot globally. If already deactivated, inform the user."
    (interactive)
    (if copilot-mode
        (progn
          (copilot-mode -1)
          (setq exile/copilot-manual-mode nil)
          (message "Copilot deactivated"))
      (message "Copilot is already deactivated")))
#+end_src

**** Copilot Manual Mode Toggle
Provides a way to manually control when Copilot suggestions appear.

#+begin_src emacs-lisp
  (defun exile/copilot-toggle-manual-mode ()
    "Toggle Copilot's manual mode."
    (interactive)
    (if exile/copilot-manual-mode
        (progn
          (setq exile/copilot-manual-mode nil)
          (message "Copilot manual mode deactivated"))
      (progn
        (setq exile/copilot-manual-mode t)
        ;; Ensure Copilot is activated if we're switching to manual mode.
        (unless copilot-mode
          (global-copilot-mode 1))
        (message "Copilot manual mode activated"))))
#+end_src
