init.el

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   ;; Add more languages as needed
   ))
(setq org-confirm-babel-evaluate nil) ;; Disables confirmation prompt for code block execution.

;; Automatically tangle our Emacs.org config file when we save it
(defun exile/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name exile/emacs-file))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'exile/org-babel-tangle-config)))

(require 'org-tempo)
(eval-after-load 'org
'(progn
  (add-to-list 'org-structure-template-alist '("bat" . "src bat"))))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "✸" "✿" "✜" "✚" "✦"))
  )

;; center text in org mode
(defun exile/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
	visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . exile/org-mode-visual-fill)
  )

;; company - auto-completion
(use-package company
  :init
  (add-hook 'after-init-hook 'global-company-mode)
  (setq company-minimum-prefix-length 3
        company-selection-wrap-around t 
        company-tooltip-limit 20
        company-tooltip-minimum-width 15
        company-tooltip-align-annotations t))

(use-package copilot
  :straight (:host github :repo "copilot-emacs/copilot.el" :files ("dist" "*.el"))
  :diminish ;; don't show in mode line (we don't wanna get caught cheating, right? ;)
  :config

  ;; global keybindings
  (general-def
    "TAB" #'exile/company-or-copilot-or-indent ; for tab completion
    "M-C-<return>" #'exile/copilot-trigger ; for manual mode (FIX ME): this doesnt seems to work rn
    )
  )

;; Flags to control Copilot's behavior
(defvar exile/copilot-manual-mode nil
  "When `t', Copilot only shows completions when manually triggered.")

(defvar exile/company-active nil
  "Flag to indicate whether Company's completion menu is active.")

(defun exile/copilot-quit ()
  "Run `copilot-clear-overlay' or `keyboard-quit'. If copilot is cleared, make sure the overlay doesn't come back too soon."
  (interactive)
  (condition-case err
      (when (bound-and-true-p copilot--overlay)
        (let ((pre-copilot-disable-predicates copilot-disable-predicates))
          (setq copilot-disable-predicates (list (lambda () t)))
          (copilot-clear-overlay)
          (run-with-idle-timer
           1.0
           nil
           (lambda ()
             (setq copilot-disable-predicates pre-copilot-disable-predicates)))))
    (error (message "Error handling Copilot overlay: %s" err))))

(defun exile/clear-copilot-during-company ()
  "Clear Copilot's overlay if Company is active."
  (when exile/company-active
    (message "Company completion active, clearing Copilot overlay.")
    (exile/copilot-quit)))

(defun exile/company-started (arg)
  "Hook function called when Company completion starts."
  (setq exile/company-active t)
  (add-hook 'pre-command-hook #'exile/clear-copilot-during-company)
  (message "Company completion started."))

(defun exile/company-finished (arg)
  "Hook function called when Company completion finishes or is cancelled."
  (remove-hook 'pre-command-hook #'exile/clear-copilot-during-company)
  (setq exile/company-active nil))

;; Catch the start and finish of company completion
(with-eval-after-load 'company
  (add-hook 'company-completion-started-hook #'exile/company-started)
  (add-hook 'company-completion-finished-hook #'exile/company-finished)
  (add-hook 'company-completion-cancelled-hook #'exile/company-finished))

(defun exile/copilot-trigger ()
  "Try to trigger completion with Copilot."
  (interactive)
  (if (fboundp 'copilot-complete)
      (copilot-complete)
    (message "Copilot completion function not available.")))

(defun exile/company-or-copilot-or-indent ()
  "Enhanced completion logic to avoid conflicts between Copilot and Company."
  (interactive)
  (cond
   (exile/company-active
    (company-complete-selection))
   ((copilot--overlay-visible)
    (copilot-accept-completion))
   (t
    (indent-for-tab-command))))

(defun exile/copilot-activate ()
  "Activate Copilot globally. If already activated, inform the user."
  (interactive)
  (if copilot-mode
      (message "Copilot is already activated")
    (progn
      (copilot-mode 1)
      (setq exile/copilot-manual-mode nil)
      (message "Copilot activated"))))

(defun exile/copilot-deactivate ()
  "Deactivate Copilot globally. If already deactivated, inform the user."
  (interactive)
  (if copilot-mode
      (progn
        (copilot-mode -1)
        (setq exile/copilot-manual-mode nil)
        (message "Copilot deactivated"))
    (message "Copilot is already deactivated")))

(defun exile/copilot-toggle-manual-mode ()
  "Toggle Copilot's manual mode."
  (interactive)
  (if exile/copilot-manual-mode
      (progn
        (setq exile/copilot-manual-mode nil)
        (message "Copilot manual mode deactivated"))
    (progn
      (setq exile/copilot-manual-mode t)
      ;; Ensure Copilot is activated if we're switching to manual mode.
      (unless copilot-mode
        (global-copilot-mode 1))
      (message "Copilot manual mode activated"))))
